package com.pattern.sarketab.ui;

import android.content.Context;
import android.content.Intent;
import android.net.ConnectivityManager;
import android.os.Bundle;
import android.text.Editable;
import android.text.InputFilter;
import android.text.TextWatcher;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ImageView;
import android.widget.RelativeLayout;
import android.widget.Spinner;
import android.widget.Toast;

import androidx.annotation.Nullable;

import com.pattern.alasraar.R;
import com.pattern.sarketab.data.local.models.GetData;
import com.pattern.sarketab.data.preferences.LocalStorage;
import com.pattern.sarketab.ui.Modle.M_map;
import com.pattern.sarketab.ui.Sarketab.helper_changename;
import com.pattern.sarketab.ui.Sarketab.helper_hajat;
import com.pattern.sarketab.ui.retro.App;
import com.pattern.sarketab.ui.retro.Method_Conection;
import com.thebrownarrow.customfont.CustomFontEditText;
import com.thebrownarrow.customfont.CustomFontTextView;

import java.util.HashMap;
import java.util.List;

import javax.inject.Inject;

import dagger.android.support.DaggerAppCompatActivity;
import retrofit2.Call;
import retrofit2.Callback;
import retrofit2.Response;

/**
 * Created by kavak ;)
 */
public class ActivityChange_name extends DaggerAppCompatActivity implements AdapterView.OnItemSelectedListener {
    @Inject
    LocalStorage localStorage;
    private static final String TAG = "ActivityEzdevaj";
    CustomFontEditText changeName;
    CustomFontTextView change_name_sum;
    CustomFontEditText change_mom_name;
    CustomFontTextView change_mom_name_sum;
    RelativeLayout ezdevajNatijeh;
    ImageView back;
    Spinner spinner;
    int m_num= 0;
    int NameSum;
    int momSum;
    private HashMap<String,Integer> Abjad ;
    helper_changename db_helper_changename;
    String txt, txt1, code_d, lang;

    @Override
    protected void onCreate(@Nullable Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.fragment_changename);
        initView();

        db_helper_changename = new helper_changename(this);
        new Thread(new Runnable() {
            @Override
            public void run() {
                if (db_helper_changename.numberOfRows() > 0){
                    if (isNetworkConnected()) get_change_name();
                }else{
                    if (isNetworkConnected()) get_change_name();
                    else offline();

                }
            }
        }).start();



        back.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                onBackPressed();
            }
        });


        ezdevajNatijeh.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                if (NameSum !=0 && momSum !=0 ) {
                    int num = (NameSum + momSum ) % 12;
                    if (num == 0) num=12;
                    Intent intent = new Intent(ActivityChange_name.this, ActivityResult.class);
                    intent.putExtra("num", num);
                    intent.putExtra("activity", 12);
                    startActivity(intent);
                }else {
                    Toast.makeText(ActivityChange_name.this, getResources().getString(R.string.fillFields), Toast.LENGTH_SHORT).show();
                }
            }
        });
        changeName.addTextChangedListener(new TextWatcher()
        {
            @Override
            public void afterTextChanged(Editable mEdit)
            {
            }

            public void beforeTextChanged(CharSequence s, int start, int count, int after){

            }

            public void onTextChanged(CharSequence s, int start, int before, int count) {
                change_name_sum.setText("0");

                if (changeName.length() == 15){
                    check_char(changeName.getText().toString() , changeName);
                }

                if (!s.equals("")) {
                    NameSum = 0;
                    String m =  s.toString();
                    m+=1;
                    String[] m1 = m.split("");
                    for (int i = 0; i < m1.length; i++) {
                        try {
                            NameSum += Abjad.get(m1[i]);
                            m_num+=1;
                            change_name_sum.setText(Integer.toString(NameSum));
                        } catch (Exception e) {
                        }
                    }

                }
            }
        });



        change_mom_name.addTextChangedListener(new TextWatcher()
        {
            @Override
            public void afterTextChanged(Editable mEdit)
            {
            }

            public void beforeTextChanged(CharSequence s, int start, int count, int after){

            }

            public void onTextChanged(CharSequence s, int start, int before, int count) {
                change_mom_name_sum.setText("0");

                if (change_mom_name.length() == 15){
                    check_char(change_mom_name.getText().toString() , change_mom_name);
                }

                if (!s.equals("")) {
                    momSum = 0;
                    String m =  s.toString();
                    m+=1;
                    String[] m1 = m.split("");
                    for (int i = 0; i < m1.length; i++) {
                        try {
                            momSum += Abjad.get(m1[i]);
                            m_num+=1;
                            change_mom_name_sum.setText(Integer.toString(momSum));
                        } catch (Exception e) {
                        }
                    }

                }
            }
        });




    }


    public void initView(){
        Abjad = GetData.getAbjadList();
        back = findViewById(R.id.back);
        ezdevajNatijeh = findViewById(R.id.ghaeb_natijeh);
        changeName = findViewById(R.id.change_name);
        change_mom_name = findViewById(R.id.change_mom_name);

        change_name_sum = findViewById(R.id.chane_name_sum);
        change_mom_name_sum = findViewById(R.id.change_mom_name_sum);



        back = findViewById(R.id.ghaeb_back);
        spinner = findViewById(R.id.spinner);
    }


    @Override
    public void onItemSelected(AdapterView<?> parent, View view, int position, long id) {

    }

    @Override
    public void onNothingSelected(AdapterView<?> parent) {

    }

    public void get_change_name() {
        Method_Conection service = App.getApplication().create(Method_Conection.class);
        Call<List<M_map>> call = service.changename("changename");
        call.enqueue(new Callback<List<M_map>>() {
            @Override
            public void onResponse(Call<List<M_map>> call, Response<List<M_map>> response) {
                try {

                    for (int i = 0; i < response.body().size(); i++) {
                        txt = response.body().get(i).title;
                        txt1 = response.body().get(i).txt;
                        code_d = response.body().get(i).code;
                        lang = response.body().get(i).lang;
                        db_helper_changename.insertChangename(txt, txt1, code_d, lang);

                    }

                } catch (NullPointerException e) {
                    offline();
                    //Toast.makeText(ActivityHajat.this , e.toString()+"||EE",Toast.LENGTH_LONG).show();
                }
            }

            @Override
            public void onFailure(Call<List<M_map>> call, Throwable t) {
                offline();
                //Toast.makeText(ActivityHajat.this , t.toString()+"||EggE",Toast.LENGTH_LONG).show();
            }
        });
    }

    private boolean isNetworkConnected() {
        ConnectivityManager cm = (ConnectivityManager) getSystemService(Context.CONNECTIVITY_SERVICE);

        return cm.getActiveNetworkInfo() != null && cm.getActiveNetworkInfo().isConnected();
    }


    public void offline(){
        db_helper_changename.insertChangename("اشرافي عالي" ,"دسته چهارم يا طبقه اشرافي بطور خلاصه اين خصوصيات را دارا هستند :\n" +
                "صاحبان اين دسته از اسامي كه معروف به اسامي اشرافي هستند خود بخود استعداد جذب ثروت و پول را دارا هستند و همچنين خداوند عزيز طبق حكمت وقوانين حاكم بر هستي در اين دسته از اسامي استعداد جذب معنويات و عرفان و متافيزيك را نيز قرار داده است.واين به اين معني است كه دسته ي اشرافي كه بهترين دسته ي اسامي هستند هم نيروي جذب ثروت را دارند و هم مستعد عرفان و متافيزيك و كسب علم ميباشند.يعني تمام خصوصيات عرفانيها را دارا هستند ام بيش از اينكه جاذب معنويت و عرفان باشند جاذب ثروتند.\n" +
                "براي اين افراد از در و ديوار پول ميبارد.دست به خاكستر بزنند طلا ميشود.اصولا در هركاري كه قدم بگذارند موفق ميشوند و پيشرفت ميكنند .\n" +
                "براي اشرافيها رسيدن به جايگاه اجتماعي و مالي بالا انتظار ميرود. البته وجود حادثه ساز در خانواده ي اين افراد اين موارد مثبت را تحت الشعاع قرار ميدهد.\n" +
                "كلا هر يك از دسته اسامي يكسري خصويات مثبت وخوب دارند و يكسري خصوصيات منفي و بد. اين دسته ( اشرافي) هم مثتثني نيست. اين دسته گرچه بهترين دسته است و ايمني بهتر و بيشتري از دسته هاي ديگر دارد اما معمولا افراديكه نام اشرافي دارند كله شقي و لجبازي خاص خود را نيز دارند.\n" +
                "اين افراد به شرطي موفق ميشوند كه در تمام كارهايي كه ميخواهند انجام دهند با اهلش مشورت كنند و الا با ضرر مواجه خواهند شد. كله شقي و خود رايي اين افراد معمولا كار دستشان ميدهد.\n" +
                "چه بسا افرادي كه تخصص و ظاهر و كلاس و... براي پول درآوردن ورشد وترقي را ندارند و صرفا بخاطر اينكه نامشان نام اشرافي و بسيار خوبي است خود بخود جاذب ثروت هستند و در شغل خود بسيار عالي كسب درآمد ميكنند.\n" +
                "در اين دسته نيز تمام خوبيهايي كه ذكر شد وقتي بخوبي خود را نمايان ميكند كه صاحب نام اشرافي در كنار نام حادثه ساز قرار نگيرد.\n" +
                "دسته ي اشرافي هم سه زير شاخه ي عالي – عادي و متضرر دارد كه دسته ي عالي آن تمام خصوصياتي كه در بالا ذكر شد را دارا هستند و همچنين دسته ي اشرافي عادي نيز همه ي خصوصيات را دارد اما كم رنگتر از دسته ي اشرافي عالي.\n" +
                "و اما دسته ي اشرافي متضرر كه يكي از بدترين دسته هاي اسامي است بخصوص براي آقايان :\n" +
                "اشرافي متضرر جاذب ثروت هست ولي مدام مال و اموال خود را به باد ميدهد و در مسيري قرار ميگيرد كه مال خود را از بين ميبرد. اين دسته عموما پول به باد بده و كله شق و لجباز هستند و همين كله شقي و لجبازي زندگي انها را خراب ميكند.\n" +
                "ممكن است بگويند ما كله شق و لجباز نيستيم و واقعا هم همينگونه باشد ولي خود نيك ميدانند كه بر خلاف ميل باطنيشان عمل ميكنند.\n" +
                "اين دسته براي آقايان بسيارخطرناك است.معمولا اشرافي متضرر ( چه مرد باشد و چه زن ) پول خود را از راههايي مثل ( گران خريدن – خرج بي جا و بي مورد – كلاهبرادري از سرش – دزدي مالش و ... نظير اينها ) از دست ميدهد. اين دسته معروف به \"پول به باد بده\" هستند. و غالبا از 25 سالگي تا 40 سالگي بامشكلات متعددي اعم از مشكلات مالي و غير مالي مواجه ميشوند. وپس از 40 سالگي هم همان جذب و نابودي ثروت را بدنبال خود خواهند داشت.\n" +
                "در خانمهاي اشرافي متضرر اگر در خانواده شان حادثه سازي وجود داشته باشد احتمال ناباروري يا اختلال در سيستم باروريشان ديده شده است.\n" +
                "مجددا متذكر ميشويم كه : تمام خوبيهايي كه براي اين دسته ذكر شد وقتي بخوبي خود را نمايان ميكند كه صاحب نام اشرافي در كنار نام حادثه ساز قرار نگيرد.\n","1","0");
        db_helper_changename.insertChangename("اشرافي عادي" ,"دسته چهارم يا طبقه اشرافي بطور خلاصه اين خصوصيات را دارا هستند :\n" +
                "صاحبان اين دسته از اسامي كه معروف به اسامي اشرافي هستند خود بخود استعداد جذب ثروت و پول را دارا هستند و همچنين خداوند عزيز طبق حكمت وقوانين حاكم بر هستي در اين دسته از اسامي استعداد جذب معنويات و عرفان و متافيزيك را نيز قرار داده است.واين به اين معني است كه دسته ي اشرافي كه بهترين دسته ي اسامي هستند هم نيروي جذب ثروت را دارند و هم مستعد عرفان و متافيزيك و كسب علم ميباشند.يعني تمام خصوصيات عرفانيها را دارا هستند ام بيش از اينكه جاذب معنويت و عرفان باشند جاذب ثروتند.\n" +
                "براي اين افراد از در و ديوار پول ميبارد.دست به خاكستر بزنند طلا ميشود.اصولا در هركاري كه قدم بگذارند موفق ميشوند و پيشرفت ميكنند .\n" +
                "براي اشرافيها رسيدن به جايگاه اجتماعي و مالي بالا انتظار ميرود. البته وجود حادثه ساز در خانواده ي اين افراد اين موارد مثبت را تحت الشعاع قرار ميدهد.\n" +
                "كلا هر يك از دسته اسامي يكسري خصويات مثبت وخوب دارند و يكسري خصوصيات منفي و بد. اين دسته ( اشرافي) هم مثتثني نيست. اين دسته گرچه بهترين دسته است و ايمني بهتر و بيشتري از دسته هاي ديگر دارد اما معمولا افراديكه نام اشرافي دارند كله شقي و لجبازي خاص خود را نيز دارند.\n" +
                "اين افراد به شرطي موفق ميشوند كه در تمام كارهايي كه ميخواهند انجام دهند با اهلش مشورت كنند و الا با ضرر مواجه خواهند شد. كله شقي و خود رايي اين افراد معمولا كار دستشان ميدهد.\n" +
                "چه بسا افرادي كه تخصص و ظاهر و كلاس و... براي پول درآوردن ورشد وترقي را ندارند و صرفا بخاطر اينكه نامشان نام اشرافي و بسيار خوبي است خود بخود جاذب ثروت هستند و در شغل خود بسيار عالي كسب درآمد ميكنند.\n" +
                "در اين دسته نيز تمام خوبيهايي كه ذكر شد وقتي بخوبي خود را نمايان ميكند كه صاحب نام اشرافي در كنار نام حادثه ساز قرار نگيرد.\n" +
                "دسته ي اشرافي هم سه زير شاخه ي عالي – عادي و متضرر دارد كه دسته ي عالي آن تمام خصوصياتي كه در بالا ذكر شد را دارا هستند و همچنين دسته ي اشرافي عادي نيز همه ي خصوصيات را دارد اما كم رنگتر از دسته ي اشرافي عالي.\n" +
                "و اما دسته ي اشرافي متضرر كه يكي از بدترين دسته هاي اسامي است بخصوص براي آقايان :\n" +
                "اشرافي متضرر جاذب ثروت هست ولي مدام مال و اموال خود را به باد ميدهد و در مسيري قرار ميگيرد كه مال خود را از بين ميبرد. اين دسته عموما پول به باد بده و كله شق و لجباز هستند و همين كله شقي و لجبازي زندگي انها را خراب ميكند.\n" +
                "ممكن است بگويند ما كله شق و لجباز نيستيم و واقعا هم همينگونه باشد ولي خود نيك ميدانند كه بر خلاف ميل باطنيشان عمل ميكنند.\n" +
                "اين دسته براي آقايان بسيارخطرناك است.معمولا اشرافي متضرر ( چه مرد باشد و چه زن ) پول خود را از راههايي مثل ( گران خريدن – خرج بي جا و بي مورد – كلاهبرادري از سرش – دزدي مالش و ... نظير اينها ) از دست ميدهد. اين دسته معروف به \"پول به باد بده\" هستند. و غالبا از 25 سالگي تا 40 سالگي بامشكلات متعددي اعم از مشكلات مالي و غير مالي مواجه ميشوند. وپس از 40 سالگي هم همان جذب و نابودي ثروت را بدنبال خود خواهند داشت.\n" +
                "در خانمهاي اشرافي متضرر اگر در خانواده شان حادثه سازي وجود داشته باشد احتمال ناباروري يا اختلال در سيستم باروريشان ديده شده است.\n" +
                "مجددا متذكر ميشويم كه : تمام خوبيهايي كه براي اين دسته ذكر شد وقتي بخوبي خود را نمايان ميكند كه صاحب نام اشرافي در كنار نام حادثه ساز قرار نگيرد.\n","2","0");
        db_helper_changename.insertChangename("عرفاني عالي" ,"افرادي كه در دسته ي عرفاني هستند خود بخود در مسير عرفان وكسب معرفت و علم دانش قرار ميگيرند و چون مستعد عرفان ومتافيزيك هستند وبه اين امور علاقه مند خواهند شد و اگر شرايط پيرامونشان مهيا باشد و در اين مسير قدم بردارند در اين امور بسيار موفق خواهند بود.\n" +
                "همانگونه كه ذكر شد اين افراد بيش از اينكه استعداد جذب مال و ثروث را داشته باشند مستعد جذب معنويات هستند اما در امور مالي هم هرچه به سنشان افزوده ميشود پله به پله بالا ميروند.\n" +
                "اين دسته و دسته ي بعدي كه اشرافيها هستند غالبا تا آخر عمر حتي اگر راه را بخطا روند بلاخره نقطه عطفي پيدا خواهند كرد و در مسير حقيقت قرار خواهند گرفت.قرار گرفتن استادي در مسير زندگي اين افراد براي دستگيري از آنها امري طبيعي است.\n" +
                "بسياري از عرفا و افرادي كه در متافيزيك حرفي براي گفتن دارند در اين دسته قرار دارند.\n" +
                "براي فهم فرق بين اين دسته و دسته اشرافي خصوصيات اشرافي ها را نيز بخوانيد.\n" +
                "دسته ي عرفاني هم همانند ديگر دسته ها به سه شاخه ي فرعي عالي – عادي ومتضرر تقسيم ميشود.\n" +
                "افرادي كه دردسته ي عالي قرار دارند سير رشدشان از لحاط مادي و معنوي بهتر از دسته ي عادي و متضرر است و زودتر به موفقيتهاي مادي و معنوي دست پيدا خواهند كرد.\n" +
                "افراد متضرر عرفاني بشدت در معرض خطر از حادثه سازهاي پيرامون خود هستند.اگر در افراد درجه يك خانواده ي اينها حادثه سازي وجود داشته باشد اينها بسيار تحت تاثير منفي نام او قرار خواهندگرفت.\n" +
                "عرفاني متضرر معمولا اين شاخه به آن شاخه ميشوند. چند صباحي مثلا كلاس گلدوزي ميروند ونيمه كاره رها و بعداز آن كلاس خياطي ميروند وبه همين ترتيب....\n" +
                "در آقايان نيز همين گونه است .اين افراد مدام شغل و كلاس و .. عوض ميكنند و معمولا به جايي هم نميرسند و اگر هم رسيدند و اين شاخه به آن شاخه نشدند \"خودشان خوب ميدانند كه برخلاف ميل باطنيشان عمل كرده و ميكنند\".\n" +
                "دسته ي عرفاني عموما و بالاخص عرفاني متضرر هم بعد از حادثه ساز و كم درآمد بخصوص وقتي در كنار نام حادثه ساز قرار بگيرند در معرض اعتيادهاي ذكر شده و افسردگي و.. هستند.\n" +
                "تمام خوبيهايي كه براي اين دسته ذكر شد وقتي بخوبي خود را نمايان ميكند كه در كنار نام حادثه ساز قرار نگيرد.\n","3","0");
        db_helper_changename.insertChangename("عرفاني عادی" ,"افرادي كه در دسته ي عرفاني هستند خود بخود در مسير عرفان وكسب معرفت و علم دانش قرار ميگيرند و چون مستعد عرفان ومتافيزيك هستند وبه اين امور علاقه مند خواهند شد و اگر شرايط پيرامونشان مهيا باشد و در اين مسير قدم بردارند در اين امور بسيار موفق خواهند بود.\n" +
                "همانگونه كه ذكر شد اين افراد بيش از اينكه استعداد جذب مال و ثروث را داشته باشند مستعد جذب معنويات هستند اما در امور مالي هم هرچه به سنشان افزوده ميشود پله به پله بالا ميروند.\n" +
                "اين دسته و دسته ي بعدي كه اشرافيها هستند غالبا تا آخر عمر حتي اگر راه را بخطا روند بلاخره نقطه عطفي پيدا خواهند كرد و در مسير حقيقت قرار خواهند گرفت.قرار گرفتن استادي در مسير زندگي اين افراد براي دستگيري از آنها امري طبيعي است.\n" +
                "بسياري از عرفا و افرادي كه در متافيزيك حرفي براي گفتن دارند در اين دسته قرار دارند.\n" +
                "براي فهم فرق بين اين دسته و دسته اشرافي خصوصيات اشرافي ها را نيز بخوانيد.\n" +
                "دسته ي عرفاني هم همانند ديگر دسته ها به سه شاخه ي فرعي عالي – عادي ومتضرر تقسيم ميشود.\n" +
                "افرادي كه دردسته ي عالي قرار دارند سير رشدشان از لحاط مادي و معنوي بهتر از دسته ي عادي و متضرر است و زودتر به موفقيتهاي مادي و معنوي دست پيدا خواهند كرد.\n" +
                "افراد متضرر عرفاني بشدت در معرض خطر از حادثه سازهاي پيرامون خود هستند.اگر در افراد درجه يك خانواده ي اينها حادثه سازي وجود داشته باشد اينها بسيار تحت تاثير منفي نام او قرار خواهندگرفت.\n" +
                "عرفاني متضرر معمولا اين شاخه به آن شاخه ميشوند. چند صباحي مثلا كلاس گلدوزي ميروند ونيمه كاره رها و بعداز آن كلاس خياطي ميروند وبه همين ترتيب....\n" +
                "در آقايان نيز همين گونه است .اين افراد مدام شغل و كلاس و .. عوض ميكنند و معمولا به جايي هم نميرسند و اگر هم رسيدند و اين شاخه به آن شاخه نشدند \"خودشان خوب ميدانند كه برخلاف ميل باطنيشان عمل كرده و ميكنند\".\n" +
                "دسته ي عرفاني عموما و بالاخص عرفاني متضرر هم بعد از حادثه ساز و كم درآمد بخصوص وقتي در كنار نام حادثه ساز قرار بگيرند در معرض اعتيادهاي ذكر شده و افسردگي و.. هستند.\n" +
                "تمام خوبيهايي كه براي اين دسته ذكر شد وقتي بخوبي خود را نمايان ميكند كه در كنار نام حادثه ساز قرار نگيرد.\n","4","0");
        db_helper_changename.insertChangename("كم درآمد عالي" ,"افرادي كه نامشان در دسته ي كم درآمد قرار دارد معمولا جزء طبقه ي كم درامد جامعه قرار دارند.\n" +
                "كم درآمد به كساني گفته ميشود كه درآمدشان كمتر از زحمتي است كه ميكشند.اينگونه افراد هميشه زحمت كار بدوششان است و كمتر از ميزان فعاليتشان كسب درآمد ميكنند و پول در مي آورند.\n" +
                "اين افراد هرگاه قصد كار وفعاليت اقتصادي بزرگ و پرمايه ودرآمدي را ميكنند يا همان ابتداي كار موفق به انجامش نميشوند ويا شديدا زمين ميخورند.يعني لقمه ي بزرگ نميتوانند بردارند.\n" +
                "اين افراد به هيچ وجه نبايستي ريسك كنند و كار سنگيني انجام دهند چرا كه چون نامشان ظرفيت پذيرش درآمد سنگين را ندارد قطعا زمين ميخورند.\n" +
                "بهترين هاي اين دسته كم درآمدهاي عالي هستند كه وضعشان بهتر از كم درآمد هاي عادي و متضرر است.\n" +
                "متضرر ها با رزقي بسته مواجه خواهند بود و نه تنها در كسب وكار زياد موفق نخواهند بود بلكه دست به ضرر خوبي هم خواهند داشت وبه هر طريقي كه شده ضرر خواهند داد.\n" +
                "اگر نام حادثه سازي در افراد درجه يك افراد كم درآمد متضرر قرار بگيرد اين افراد بسيار مستعد افسردگي و اعتياد و ضررهاي ديگر خواهند شد.\n" +
                "( در اين طبقه ي كم درآمد افرادي هستند كه از اشرافي ها هم وضعيت مالي بهتري پيدا خواهند كرد چون نامشان منطبق با اعدادي خاص وويژه وبرابر با برخي اسامي قدرتمند خداوند عزوجل ميباشد. )\n" +
                "\n" +
                "خوبيهايي كه براي اين دسته ذكر شد وقتي بخوبي خود را نمايان ميكند كه در كنار نام حادثه ساز قرار نگيرد.\n" +
                "دسته سوم يا طبقه عرفاني بطور خلاصه اين خصوصيات را دارا هستند \n","5","0");
        db_helper_changename.insertChangename("كم درآمد عادي" ,"افرادي كه نامشان در دسته ي كم درآمد قرار دارد معمولا جزء طبقه ي كم درامد جامعه قرار دارند.\n" +
                "كم درآمد به كساني گفته ميشود كه درآمدشان كمتر از زحمتي است كه ميكشند.اينگونه افراد هميشه زحمت كار بدوششان است و كمتر از ميزان فعاليتشان كسب درآمد ميكنند و پول در مي آورند.\n" +
                "اين افراد هرگاه قصد كار وفعاليت اقتصادي بزرگ و پرمايه ودرآمدي را ميكنند يا همان ابتداي كار موفق به انجامش نميشوند ويا شديدا زمين ميخورند.يعني لقمه ي بزرگ نميتوانند بردارند.\n" +
                "اين افراد به هيچ وجه نبايستي ريسك كنند و كار سنگيني انجام دهند چرا كه چون نامشان ظرفيت پذيرش درآمد سنگين را ندارد قطعا زمين ميخورند.\n" +
                "بهترين هاي اين دسته كم درآمدهاي عالي هستند كه وضعشان بهتر از كم درآمد هاي عادي و متضرر است.\n" +
                "متضرر ها با رزقي بسته مواجه خواهند بود و نه تنها در كسب وكار زياد موفق نخواهند بود بلكه دست به ضرر خوبي هم خواهند داشت وبه هر طريقي كه شده ضرر خواهند داد.\n" +
                "اگر نام حادثه سازي در افراد درجه يك افراد كم درآمد متضرر قرار بگيرد اين افراد بسيار مستعد افسردگي و اعتياد و ضررهاي ديگر خواهند شد.\n" +
                "( در اين طبقه ي كم درآمد افرادي هستند كه از اشرافي ها هم وضعيت مالي بهتري پيدا خواهند كرد چون نامشان منطبق با اعدادي خاص وويژه وبرابر با برخي اسامي قدرتمند خداوند عزوجل ميباشد. )\n" +
                "\n" +
                "خوبيهايي كه براي اين دسته ذكر شد وقتي بخوبي خود را نمايان ميكند كه در كنار نام حادثه ساز قرار نگيرد.\n" +
                "دسته سوم يا طبقه عرفاني بطور خلاصه اين خصوصيات را دارا هستند \n","6","0");
        db_helper_changename.insertChangename("اشرافي متضرر" ,"دسته چهارم يا طبقه اشرافي بطور خلاصه اين خصوصيات را دارا هستند :\n" +
                "صاحبان اين دسته از اسامي كه معروف به اسامي اشرافي هستند خود بخود استعداد جذب ثروت و پول را دارا هستند و همچنين خداوند عزيز طبق حكمت وقوانين حاكم بر هستي در اين دسته از اسامي استعداد جذب معنويات و عرفان و متافيزيك را نيز قرار داده است.واين به اين معني است كه دسته ي اشرافي كه بهترين دسته ي اسامي هستند هم نيروي جذب ثروت را دارند و هم مستعد عرفان و متافيزيك و كسب علم ميباشند.يعني تمام خصوصيات عرفانيها را دارا هستند ام بيش از اينكه جاذب معنويت و عرفان باشند جاذب ثروتند.\n" +
                "براي اين افراد از در و ديوار پول ميبارد.دست به خاكستر بزنند طلا ميشود.اصولا در هركاري كه قدم بگذارند موفق ميشوند و پيشرفت ميكنند .\n" +
                "براي اشرافيها رسيدن به جايگاه اجتماعي و مالي بالا انتظار ميرود. البته وجود حادثه ساز در خانواده ي اين افراد اين موارد مثبت را تحت الشعاع قرار ميدهد.\n" +
                "كلا هر يك از دسته اسامي يكسري خصويات مثبت وخوب دارند و يكسري خصوصيات منفي و بد. اين دسته ( اشرافي) هم مثتثني نيست. اين دسته گرچه بهترين دسته است و ايمني بهتر و بيشتري از دسته هاي ديگر دارد اما معمولا افراديكه نام اشرافي دارند كله شقي و لجبازي خاص خود را نيز دارند.\n" +
                "اين افراد به شرطي موفق ميشوند كه در تمام كارهايي كه ميخواهند انجام دهند با اهلش مشورت كنند و الا با ضرر مواجه خواهند شد. كله شقي و خود رايي اين افراد معمولا كار دستشان ميدهد.\n" +
                "چه بسا افرادي كه تخصص و ظاهر و كلاس و... براي پول درآوردن ورشد وترقي را ندارند و صرفا بخاطر اينكه نامشان نام اشرافي و بسيار خوبي است خود بخود جاذب ثروت هستند و در شغل خود بسيار عالي كسب درآمد ميكنند.\n" +
                "در اين دسته نيز تمام خوبيهايي كه ذكر شد وقتي بخوبي خود را نمايان ميكند كه صاحب نام اشرافي در كنار نام حادثه ساز قرار نگيرد.\n" +
                "دسته ي اشرافي هم سه زير شاخه ي عالي – عادي و متضرر دارد كه دسته ي عالي آن تمام خصوصياتي كه در بالا ذكر شد را دارا هستند و همچنين دسته ي اشرافي عادي نيز همه ي خصوصيات را دارد اما كم رنگتر از دسته ي اشرافي عالي.\n" +
                "و اما دسته ي اشرافي متضرر كه يكي از بدترين دسته هاي اسامي است بخصوص براي آقايان :\n" +
                "اشرافي متضرر جاذب ثروت هست ولي مدام مال و اموال خود را به باد ميدهد و در مسيري قرار ميگيرد كه مال خود را از بين ميبرد. اين دسته عموما پول به باد بده و كله شق و لجباز هستند و همين كله شقي و لجبازي زندگي انها را خراب ميكند.\n" +
                "ممكن است بگويند ما كله شق و لجباز نيستيم و واقعا هم همينگونه باشد ولي خود نيك ميدانند كه بر خلاف ميل باطنيشان عمل ميكنند.\n" +
                "اين دسته براي آقايان بسيارخطرناك است.معمولا اشرافي متضرر ( چه مرد باشد و چه زن ) پول خود را از راههايي مثل ( گران خريدن – خرج بي جا و بي مورد – كلاهبرادري از سرش – دزدي مالش و ... نظير اينها ) از دست ميدهد. اين دسته معروف به \"پول به باد بده\" هستند. و غالبا از 25 سالگي تا 40 سالگي بامشكلات متعددي اعم از مشكلات مالي و غير مالي مواجه ميشوند. وپس از 40 سالگي هم همان جذب و نابودي ثروت را بدنبال خود خواهند داشت.\n" +
                "در خانمهاي اشرافي متضرر اگر در خانواده شان حادثه سازي وجود داشته باشد احتمال ناباروري يا اختلال در سيستم باروريشان ديده شده است.\n" +
                "مجددا متذكر ميشويم كه : تمام خوبيهايي كه براي اين دسته ذكر شد وقتي بخوبي خود را نمايان ميكند كه صاحب نام اشرافي در كنار نام حادثه ساز قرار نگيرد.\n","7","0");
        db_helper_changename.insertChangename("عرفاني متضرر" ,"افرادي كه در دسته ي عرفاني هستند خود بخود در مسير عرفان وكسب معرفت و علم دانش قرار ميگيرند و چون مستعد عرفان ومتافيزيك هستند وبه اين امور علاقه مند خواهند شد و اگر شرايط پيرامونشان مهيا باشد و در اين مسير قدم بردارند در اين امور بسيار موفق خواهند بود.\n" +
                "همانگونه كه ذكر شد اين افراد بيش از اينكه استعداد جذب مال و ثروث را داشته باشند مستعد جذب معنويات هستند اما در امور مالي هم هرچه به سنشان افزوده ميشود پله به پله بالا ميروند.\n" +
                "اين دسته و دسته ي بعدي كه اشرافيها هستند غالبا تا آخر عمر حتي اگر راه را بخطا روند بلاخره نقطه عطفي پيدا خواهند كرد و در مسير حقيقت قرار خواهند گرفت.قرار گرفتن استادي در مسير زندگي اين افراد براي دستگيري از آنها امري طبيعي است.\n" +
                "بسياري از عرفا و افرادي كه در متافيزيك حرفي براي گفتن دارند در اين دسته قرار دارند.\n" +
                "براي فهم فرق بين اين دسته و دسته اشرافي خصوصيات اشرافي ها را نيز بخوانيد.\n" +
                "دسته ي عرفاني هم همانند ديگر دسته ها به سه شاخه ي فرعي عالي – عادي ومتضرر تقسيم ميشود.\n" +
                "افرادي كه دردسته ي عالي قرار دارند سير رشدشان از لحاط مادي و معنوي بهتر از دسته ي عادي و متضرر است و زودتر به موفقيتهاي مادي و معنوي دست پيدا خواهند كرد.\n" +
                "افراد متضرر عرفاني بشدت در معرض خطر از حادثه سازهاي پيرامون خود هستند.اگر در افراد درجه يك خانواده ي اينها حادثه سازي وجود داشته باشد اينها بسيار تحت تاثير منفي نام او قرار خواهندگرفت.\n" +
                "عرفاني متضرر معمولا اين شاخه به آن شاخه ميشوند. چند صباحي مثلا كلاس گلدوزي ميروند ونيمه كاره رها و بعداز آن كلاس خياطي ميروند وبه همين ترتيب....\n" +
                "در آقايان نيز همين گونه است .اين افراد مدام شغل و كلاس و .. عوض ميكنند و معمولا به جايي هم نميرسند و اگر هم رسيدند و اين شاخه به آن شاخه نشدند \"خودشان خوب ميدانند كه برخلاف ميل باطنيشان عمل كرده و ميكنند\".\n" +
                "دسته ي عرفاني عموما و بالاخص عرفاني متضرر هم بعد از حادثه ساز و كم درآمد بخصوص وقتي در كنار نام حادثه ساز قرار بگيرند در معرض اعتيادهاي ذكر شده و افسردگي و.. هستند.\n" +
                "تمام خوبيهايي كه براي اين دسته ذكر شد وقتي بخوبي خود را نمايان ميكند كه در كنار نام حادثه ساز قرار نگيرد.\n","8","0");
        db_helper_changename.insertChangename("كم درآمد متضرر" ,"افرادي كه نامشان در دسته ي كم درآمد قرار دارد معمولا جزء طبقه ي كم درامد جامعه قرار دارند.\n" +
                "كم درآمد به كساني گفته ميشود كه درآمدشان كمتر از زحمتي است كه ميكشند.اينگونه افراد هميشه زحمت كار بدوششان است و كمتر از ميزان فعاليتشان كسب درآمد ميكنند و پول در مي آورند.\n" +
                "اين افراد هرگاه قصد كار وفعاليت اقتصادي بزرگ و پرمايه ودرآمدي را ميكنند يا همان ابتداي كار موفق به انجامش نميشوند ويا شديدا زمين ميخورند.يعني لقمه ي بزرگ نميتوانند بردارند.\n" +
                "اين افراد به هيچ وجه نبايستي ريسك كنند و كار سنگيني انجام دهند چرا كه چون نامشان ظرفيت پذيرش درآمد سنگين را ندارد قطعا زمين ميخورند.\n" +
                "بهترين هاي اين دسته كم درآمدهاي عالي هستند كه وضعشان بهتر از كم درآمد هاي عادي و متضرر است.\n" +
                "متضرر ها با رزقي بسته مواجه خواهند بود و نه تنها در كسب وكار زياد موفق نخواهند بود بلكه دست به ضرر خوبي هم خواهند داشت وبه هر طريقي كه شده ضرر خواهند داد.\n" +
                "اگر نام حادثه سازي در افراد درجه يك افراد كم درآمد متضرر قرار بگيرد اين افراد بسيار مستعد افسردگي و اعتياد و ضررهاي ديگر خواهند شد.\n" +
                "( در اين طبقه ي كم درآمد افرادي هستند كه از اشرافي ها هم وضعيت مالي بهتري پيدا خواهند كرد چون نامشان منطبق با اعدادي خاص وويژه وبرابر با برخي اسامي قدرتمند خداوند عزوجل ميباشد. )\n" +
                "\n" +
                "خوبيهايي كه براي اين دسته ذكر شد وقتي بخوبي خود را نمايان ميكند كه در كنار نام حادثه ساز قرار نگيرد.\n" +
                "دسته سوم يا طبقه عرفاني بطور خلاصه اين خصوصيات را دارا هستند \n","9","0");
        db_helper_changename.insertChangename("حادثه ساز عالي" ,"افرادي هستند كه \"غالبا\" تا كودكند مدام مريض ميشوند يا دندان كروچه و ناخن جوي دارند يا از خواب ميپرند و....اينها كساني هستند كه براحتي موجودات غير اورگانيك نظير جنيان را بخود جذب ميكنند و گاها مسخر جنيان ميشوند و غالبا بخاطر نفوذ جنيان و همچنين طبيعت شكل گرفتن حس آنها اين افراد حس ششم خوبي دارند افراد حادثه ساز غالبا زود چشم ميخورند از همان كودكي تا بعد مدام بدبياري نصيبشان ميشود و عموما در سه حوزه ي سلامتي – اشتغال وكسب وكار – و ازدواج با مشكل مواجه ميشوند. غير ممكن است كه انساني كه نامش دردسته ي حادثه ساز است در يكي از اين سه حوزه دچار مشكل نشود و اقلا از يكي از اينها ضربه ميخورند. اين افراد دائما يك بيماري را بدنبال خود يدك ميكشند.","10","0");
        db_helper_changename.insertChangename("حادثه ساز عادي" ,"افرادي هستند كه \"غالبا\" تا كودكند مدام مريض ميشوند يا دندان كروچه و ناخن جوي دارند يا از خواب ميپرند و....اينها كساني هستند كه براحتي موجودات غير اورگانيك نظير جنيان را بخود جذب ميكنند و گاها مسخر جنيان ميشوند و غالبا بخاطر نفوذ جنيان و همچنين طبيعت شكل گرفتن حس آنها اين افراد حس ششم خوبي دارند افراد حادثه ساز غالبا زود چشم ميخورند از همان كودكي تا بعد مدام بدبياري نصيبشان ميشود و عموما در سه حوزه ي سلامتي – اشتغال وكسب وكار – و ازدواج با مشكل مواجه ميشوند. غير ممكن است كه انساني كه نامش دردسته ي حادثه ساز است در يكي از اين سه حوزه دچار مشكل نشود و اقلا از يكي از اينها ضربه ميخورند. اين افراد دائما يك بيماري را بدنبال خود يدك ميكشند.\n" +
                "متاسفانه تصادف و جوانمرگي در افراد حادثه ساز بيشترين تعداد آمار را نشان ميدهد.\n" +
                "زندگي اين افراد غالبا بي بركت خواهد بود.\n" +
                "دست افرادي با نام حادثه ساز براي ديگران نمك دارد ولي براي خودشان اصلا نمك ندارد.\n" +
                "اين افراد ممكن است از لحاظ مالي درآمد بالايي هم داشته باشند ولي غير ممكن است كه ضرر ندهند ويا مالباخته نشوند و يا پولشان را افراد ديگر بگيرند و پس ندهندو.. غالبا پولي كه درميآورند بركت نداشته و زود نابود ميشود.\n" +
                "شراكت با اين افراد هميشه موجب ضرر و ازدواج با اين افراد هميشه با اختلال مواجه خواهد بود و ممكن است اقلا در يكي از سه حوزه ي سلامتي و وضعيت مالي و همچنين تفاهمات بين زن وشوهر و فرزندان و ديگر افراد خانواده اختلال ايجاد كند. احتمال طلاق و جدايي در اين افراد بسيار بالاست و موارد بسياري به ما گزارش شده است.\n" +
                "بروز اختلال در باروري اين افراد احتمال ميرود و چه بسا بچه دار نشوند چرا كه بسياري از موارد ناباروري در خاواده هاييست كه زن يا مرد يا افراد درجه يك آنها حادثه سازند.\n" +
                "اگر يكي از افراد خانواده از خواهر وبرادر وهمسر وفرزند و مادر وپدر (خصوصا پدر و مادر) حادثه ساز باشند ديگر افراد خانواده بالاخص كم درآمدها و عرفانيها بخصوص افرادي كه در دسته هاي متضرر قرار دارند در يكي از حوزه هاي ذكر شده(وضعيت مالي-سلامتي- ازدواج وتفاهمات خانوادگي) قطعا آسيب ميبينند. ورشكستگي والدين يكي از احتمالات بالاي وجود حادثه ساز درخانواده است.\n" +
                "واگر تعداد حادثه سازها دو نفر باشد وضعيت خطرناكتر خواهد شد و اگر خداي ناكرده نامهاي حادثه ساز موجود در خانواده به سه نفر يا بيشتر برسد خطرات بسيار زياد مالي وجاني گريبان گير خود افراد حادثه ساز وبستگان درجه يكش خواهد شد.\n" +
                "افراد حادثه ساز بيشترين استعداد را براي اعتياد دارند وبسياري از معتادان در اين دسته قرار دارند اعتياد در سه حوزه ي مواد مخدر – مشروبات الكلي – و خودارضائي. ... افسرگي و مشكلات روحي ورواني نيز در اين دسته نام زياد ديده ميشود.\n" +
                "البته افرادي كه دسته هاي كم درآمد و عرفاني قرار دارند اگر دركنار اسم حادثه آفرين قرار بگيرند بيشترين خطر براي ابتلا به اعتياد و افسردگي و... آنها را تهديد ميكند.\n" +
                "بسياري از افرادي كه به بيماريهاي صعب العلاج مثل (دورازجان خواننده ي اين مطالب) سرطان – صرع – ام اس – تشنج و.. دچار ميشوند يا خود حادثه سازند و يا در خانواده اي هستند كه اقلا يك حادثه ساز در ان وجود دارد.\n" +
                "حادثه سازها شامل سه دسته ي عالي – عادي –و متضررند كه عالي اول به بقيه ضرر ميزند و سپس بر خود و عادي ضرر وزيانش دوطرفه و متضرر اول بخودش ضرر ميرساند وسپس بر ديگران. حادثه سازهاي متضرر بدترين دسته از اسامي هستند.\n" +
                "اين بود خصوصيات مختصري از دسته نامهاي حادثه آفرين يا حادثه ساز!!\n" +
                "\n" +
                "بطور كلي هرگونه بدي و نابساماني را ميتوان براي افراد دسته حادثه ساز انتظار داشت و هرچه مورد بد و نامطلوب در دسته هاي ديگر ذكر ميشود نيز از خصوصيات دسته ي حادثه آفرين است .\n" +
                "متاسفانه واضحتر از اين خطرات را نميتوان ذكر كرد.تاهمين اندازه هم در توضيح وتفسير آن بسيار زياده روي كرده ايم.\n" +
                " \n","11","0");
        db_helper_changename.insertChangename("حادثه ساز متضرر" ,"افرادي هستند كه \"غالبا\" تا كودكند مدام مريض ميشوند يا دندان كروچه و ناخن جوي دارند يا از خواب ميپرند و....اينها كساني هستند كه براحتي موجودات غير اورگانيك نظير جنيان را بخود جذب ميكنند و گاها مسخر جنيان ميشوند و غالبا بخاطر نفوذ جنيان و همچنين طبيعت شكل گرفتن حس آنها اين افراد حس ششم خوبي دارند افراد حادثه ساز غالبا زود چشم ميخورند از همان كودكي تا بعد مدام بدبياري نصيبشان ميشود و عموما در سه حوزه ي سلامتي – اشتغال وكسب وكار – و ازدواج با مشكل مواجه ميشوند. غير ممكن است كه انساني كه نامش دردسته ي حادثه ساز است در يكي از اين سه حوزه دچار مشكل نشود و اقلا از يكي از اينها ضربه ميخورند. اين افراد دائما يك بيماري را بدنبال خود يدك ميكشند.\n" +
                "متاسفانه تصادف و جوانمرگي در افراد حادثه ساز بيشترين تعداد آمار را نشان ميدهد.\n" +
                "زندگي اين افراد غالبا بي بركت خواهد بود.\n" +
                "دست افرادي با نام حادثه ساز براي ديگران نمك دارد ولي براي خودشان اصلا نمك ندارد.\n" +
                "اين افراد ممكن است از لحاظ مالي درآمد بالايي هم داشته باشند ولي غير ممكن است كه ضرر ندهند ويا مالباخته نشوند و يا پولشان را افراد ديگر بگيرند و پس ندهندو.. غالبا پولي كه درميآورند بركت نداشته و زود نابود ميشود.\n" +
                "شراكت با اين افراد هميشه موجب ضرر و ازدواج با اين افراد هميشه با اختلال مواجه خواهد بود و ممكن است اقلا در يكي از سه حوزه ي سلامتي و وضعيت مالي و همچنين تفاهمات بين زن وشوهر و فرزندان و ديگر افراد خانواده اختلال ايجاد كند. احتمال طلاق و جدايي در اين افراد بسيار بالاست و موارد بسياري به ما گزارش شده است.\n" +
                "بروز اختلال در باروري اين افراد احتمال ميرود و چه بسا بچه دار نشوند چرا كه بسياري از موارد ناباروري در خاواده هاييست كه زن يا مرد يا افراد درجه يك آنها حادثه سازند.\n" +
                "اگر يكي از افراد خانواده از خواهر وبرادر وهمسر وفرزند و مادر وپدر (خصوصا پدر و مادر) حادثه ساز باشند ديگر افراد خانواده بالاخص كم درآمدها و عرفانيها بخصوص افرادي كه در دسته هاي متضرر قرار دارند در يكي از حوزه هاي ذكر شده(وضعيت مالي-سلامتي- ازدواج وتفاهمات خانوادگي) قطعا آسيب ميبينند. ورشكستگي والدين يكي از احتمالات بالاي وجود حادثه ساز درخانواده است.\n" +
                "واگر تعداد حادثه سازها دو نفر باشد وضعيت خطرناكتر خواهد شد و اگر خداي ناكرده نامهاي حادثه ساز موجود در خانواده به سه نفر يا بيشتر برسد خطرات بسيار زياد مالي وجاني گريبان گير خود افراد حادثه ساز وبستگان درجه يكش خواهد شد.\n" +
                "افراد حادثه ساز بيشترين استعداد را براي اعتياد دارند وبسياري از معتادان در اين دسته قرار دارند اعتياد در سه حوزه ي مواد مخدر – مشروبات الكلي – و خودارضائي. ... افسرگي و مشكلات روحي ورواني نيز در اين دسته نام زياد ديده ميشود.\n" +
                "البته افرادي كه دسته هاي كم درآمد و عرفاني قرار دارند اگر دركنار اسم حادثه آفرين قرار بگيرند بيشترين خطر براي ابتلا به اعتياد و افسردگي و... آنها را تهديد ميكند.\n" +
                "بسياري از افرادي كه به بيماريهاي صعب العلاج مثل (دورازجان خواننده ي اين مطالب) سرطان – صرع – ام اس – تشنج و.. دچار ميشوند يا خود حادثه سازند و يا در خانواده اي هستند كه اقلا يك حادثه ساز در ان وجود دارد.\n" +
                "حادثه سازها شامل سه دسته ي عالي – عادي –و متضررند كه عالي اول به بقيه ضرر ميزند و سپس بر خود و عادي ضرر وزيانش دوطرفه و متضرر اول بخودش ضرر ميرساند وسپس بر ديگران. حادثه سازهاي متضرر بدترين دسته از اسامي هستند.\n" +
                "اين بود خصوصيات مختصري از دسته نامهاي حادثه آفرين يا حادثه ساز!!\n" +
                "\n" +
                "بطور كلي هرگونه بدي و نابساماني را ميتوان براي افراد دسته حادثه ساز انتظار داشت و هرچه مورد بد و نامطلوب در دسته هاي ديگر ذكر ميشود نيز از خصوصيات دسته ي حادثه آفرين است .\n" +
                "متاسفانه واضحتر از اين خطرات را نميتوان ذكر كرد.تاهمين اندازه هم در توضيح وتفسير آن بسيار زياده روي كرده ايم.\n" +
                " \n","12","0");

    }


    public void  check_char(String text , CustomFontEditText edit){
        String ch = "";

        int f = 0;
        int c = 0;
        for (int i=0 ; i<text.length()-1 ; i++) {
            int b = i;
            if (b >= 0 && b < text.length()) {
                ch = text.substring(i, (i + 1));
            }
            //Toast.makeText(this, b+":"+b++, Toast.LENGTH_SHORT).show();


            if (ch.equals("ط") || ch.equals("ظ") || ch.equals(" ")){
                f++;
                if(f > 7){
                    edit.setFilters(new InputFilter[]{new InputFilter.LengthFilter(21)});
                }else{
                    edit.setFilters(new InputFilter[]{new InputFilter.LengthFilter(21)});
                }
            }else{
                if(f > 7){
                    edit.setFilters(new InputFilter[]{new InputFilter.LengthFilter(21)});
                }else{
                    edit.setFilters(new InputFilter[]{new InputFilter.LengthFilter(21)});
                }
            }


            if (ch.equals("ص") || ch.equals(" ")){
                c++;
                edit.setFilters(new InputFilter[]{new InputFilter.LengthFilter(17)});
            }
        }
    }
}

